const dlOptions = [
    "Абакан",
    "Анадырь",
    "Анапа",
    "Архангельск",
    "Астрахань",
    "Барнаул",
    "Белгород",
    "Белоярский",
    "Благовещенск",
    "Братск",
    "Брянск",
    "Бугульма",
    "Владивосток",
    "Владикавказ",
    "Волгоград",
    "Воркута",
    "Воронеж",
    "Геленджик",
    "Горно-Алтайск",
    "Грозный",
    "Екатеринбург",
    "Иваново",
    "Ижевск",
    "Иркутск",
    "Йошкар-Ола",
    "Казань",
    "Калининград",
    "Калуга",
    "Кемерово",
    "Киров",
    "Когалым",
    "Комсомольск-на-Амуре",
    "Краснодар",
    "Красноярск",
    "Курган",
    "Курск",
    "Кызыл",
    "Липецк",
    "Магадан",
    "Магнитогорск",
    "Махачкала",
    "Минеральные Воды",
    "Мирный",
    "Москва",
    "Мурманск",
    "Надым",
    "Нальчик",
    "Нарьян-Мар",
    "Нерюнгри",
    "Нефтеюганск",
    "Нижневартовск",
    "Нижнекамск",
    "Нижний Новгород",
    "Новокузнецк",
    "Новосибирск",
    "Новый Уренгой",
    "Норильск",
    "Ноябрьск",
    "Нягань",
    "Омск",
    "Оренбург",
    "Орск",
    "Пенза",
    "Пермь",
    "Петрозаводск",
    "Петропавловск-Камчатский",
    "Псков",
    "Ростов-на-Дону",
    "Салехард",
    "Самара",
    "Санкт-Петербург",
    "Саранск",
    "Саратов",
    "Советский",
    "Сочи",
    "Ставрополь",
    "Стрежевой",
    "Сургут",
    "Сыктывкар",
    "Тамбов",
    "Томск",
    "Тюмень",
    "Удачный",
    "Улан-Удэ",
    "Ульяновск",
    "Ульяновск",
    "Урай",
    "Усинск",
    "Усть-Илимск",
    "Усть-Кут",
    "Уфа",
    "Ухта",
    "Хабаровск",
    "Ханты-Мансийск",
    "Чебоксары",
    "Челябинск",
    "Череповец",
    "Чита",
    "Элиста",
    "Южно-Сахалинск",
    "Якутск",
    "Ярославль"].map(o => {
    return [`<option value="${o}"></option>`, o.toLowerCase()];
});

function completeDataList(e, idlist) {
    const fill = val => document.getElementById(idlist).innerHTML = val;
    if(!e.target.value) {
        fill(dlOptions.reduce((sum, [html]) => sum + html, ''));
    } else if(!(e instanceof InputEvent)) { // OR: else if(!e.inputType)
        e.target.blur();
    } else {
        const inputValue = e.target.value.toLowerCase();
        let result = '';
        for (const [html, valuePattern] of dlOptions) {
            if (!valuePattern.indexOf(inputValue)) {
                result += html;
            } else if (result) {
                break;
            }
        }
        fill(result);
    }
}

function ClearDataList(idlist) {
    document.getElementById(idlist).innerHTML = "";

}

function fillDataListIfEmpty(idlist) {
    if(!document.getElementById(idlist).innerHTML) {
        completeDataList({ target: {} });
    }
}